{"pageProps":{"story":{"id":"technologypassion","title":"Bridging Educational Gaps with Technology","content":{"details":[{"phase":"Introduction","description":"The story of the evolution of my passion into conviction and purpose.","image":{"src":"/images/mystory/students.png","alt":"students","caption":"My first school visit to a school in Sindhupalchowk, Nepal"}},{"phase":"Namaste!","description":"I am a creative computer scientist with a knack for innovative solutions and teamwork. In the heart of Nepal, amidst its breathtaking landscapes, I was fortunate to lead an incredibly impactful initiative known as EPaath. This interactive software, which reached over 250,000 students in rural regions, was a testament to the power of collaboration and innovation. Alongside the government and a diverse team of passionate individuals, we embarked on a mission to bridge educational disparities through technology—a mission that became even more crucial during the pandemic.","image":{"src":"/images/mystory/mountain.png","alt":"mountain","caption":"Depicting beauty of Nepal, trekking in Everest region"}},{"phase":"Transformative Impact","description":"What truly set EPaath apart for me was witnessing its transformative impact firsthand. Leading the development team, my journey extended far beyond programming. We immersed ourselves in the communities we served, engaging with students, educators, and families across Nepal. The insights and stories we gathered were humbling and pivotal in refining EPaath, driving home the profound influence of technology in addressing real-world challenges.","image":{"src":"/images/mystory/epaath.png","alt":"epaath","caption":"Student learning content using EPaath"}},{"phase":"MIT Experience","description":"This project holds a special place in my heart, not merely for its statistical achievements but for the profound personal and professional growth it spurred. It solidified my belief in technology's capacity to foster positive change and propelled me to pursue further innovation at the MIT Game Lab. There, I explored the intersection of gaming and education, focusing on enhancing math and science learning. My transition from the rural classrooms of Nepal to the inventive corridors of MIT encapsulates my dedication to leveraging technology for societal benefit. This journey has been exhilarating—an exploration of potential, impact, and inspiration.","image":{"src":"/images/mystory/mitregan.png","alt":"regan","caption":"Speaking at MIT JWEL Education Conference about the games we designed at OLE Nepal"}},{"phase":"Links to check out","links":[{"text":"OLE Nepal Digital Learning Solutions","url":"https://olenepal.org/digital-learning-solutions/"},{"text":"EPaath","url":"https://epaath.olenepal.org/"},{"text":"OLE Nepal Games","url":"https://games.olenepal.org/"}]}]},"tags":{"tags":["passion","myself","story"]},"created_at":"2023-09-02T08:08:08","backTo":"/stories","type":"passion"}},"__N_SSG":true}