{"pageProps":{"story":{"id":"running","title":"Why I Run?","content":{"details":[{"phase":"Introduction","description":"I love to run. मलाई running गर्न ‍‌एकदम मनपर्छ!! I feel like I have always been running. I can’t remember a time in my life when I was not running."},{"phase":"Health Benefits","description":"Experts will tell you कि running is good for your muscles, your bones, your मुटु and more importantly to your mind, as it relieves stress. तर, म यहाँ पुरा running को health benefits को बारे कुरा गर्न आएको चाहिँ हैन है! म आफु दाैडेर,आफुले भाेगेको, सिकेको थोरै experience हरु share गर्न आएको हुँ।"},{"phase":"Running Uphill vs. Downhill","description":"Running uphill usually looks very difficult but is much safer; whereas, running downhill is perceived to be easier, but is much more riskier. The same can be said about our experiences in life. What looks at first sight to be difficult could in fact be less dangerous, and what looks simple could be filled with challenges. So, let us not assume the choices that we encounter everyday simply based on what they appear to be. Let’s also learn to weigh in on the myriad of extensions that these choices bring with them."},{"phase":"Running Alone vs. with Company","description":"Running alone can be fun. However, it presents its own set of challenges, especially when you are out there in the wild. So, always have company not just in your running but also in different aspects of your lives. The people around you allow you to see things that you might not be acutely aware of. They can provide direction, they can instill motivation, they can give support, and more importantly, they are able to contribute towards your experiences and add new meanings to them. So, it is not just about running, but equally about who you are running with."},{"phase":"Carrying Light","description":"Runners will tell you to carry light or carry what is necessary. Running is all about optimisation. It is about knowing what is required and only carrying so much. We tend to burden our lives with things that we do not need and carry unnecessary loads, in the hope that someday we might find it useful or that someday that person might come back to us. Let’s learn to leave our burdens on the side and move forward with what our life situations necessitate."},{"phase":"Getting Lost","description":"You can easily get lost when you are running. I can’t remember the number of times me and my friends have been lost, no matter how prepared we were. We have now learned that being lost is part of running. We have begun to accept it as part of our experience. However, what is more important is to keep going. Now, we don’t sit down and worry about what went wrong. We look for new ways to explore how we can keep on moving. This always leads us to new roads and new possibilities. So, the next time you are lost or stuck in some instance of your life, don’t think that it is the end. Think of it as the beginning of a new path."},{"phase":"The View from the Top","description":"The view from the top is awesome, and there is no doubt about it. However, I can say with some level of certainty that the fleeting moments while we run are equally beautiful. What makes our runs endearing are not just these goals of getting to the top but the myriads of emotions that become part of our running - whether it is anticipation, fatigue, joy or discovery. Through running, we learn to embrace our emotions. It helps us to grasp and understand not just our bodies but also our minds. Therefore, to me, running is not about reaching somewhere to get a view. It is about exploring, it is about seeking, it is about connecting."},{"phase":"Running Philosophy","description":"We run, and we have always been running - sometimes running away and sometimes running towards. The next time you run - whether it's out in the woods or in your own lives - I hope you are able to reflect on a few things. Life or running is not about being fast or slow. Life or running is not about the high or the low. It is about being aware - of the world around you, of the people around you and of your own beating heart. It is about being one with yourself and the rest. It is not just about exploring the world outside of us but equally about the revelation of the world inside of us. It is indeed a form of meditation."},{"phase":"Conclusion","description":"Therefore, I run, not because I want to get to the top. I run because I can feel my heartbeat. I run because I can explore the rhythm of my life. I run because it helps me reconnect with the world around me. I hope all of you will find your own passion that will allow you to look back at yourself and help you fine tune the rhythm of your lives. Thank you. Keep running."}]},"tags":{"tags":["passion","myself","story","running"]},"created_at":"1993-08-08T15:08:00","backTo":"/stories","type":"experiences"}},"__N_SSG":true}