{"pageProps":{"story":{"id":"ReganIntro","title":"Regan's Summary","content":{"details":[{"phase":"Introduction","description":"I am a creative computer scientist with a knack for innovative solutions and teamwork."},{"phase":"Education and Exploration","description":"I am learning more about software engineering, data management, analytics, and systems software at the University of Michigan. Meanwhile, I am also experimenting more on diverse web technologies and LLMs creating education technologies at Open Learning Exchange."},{"phase":"Past Achievements","description":"Previously, I drove a larger impact project as a Team Lead at Open Learning Exchange (OLE) Nepal, leading a game design team and co-creating EPaath (250+ interactive learning modules aligned with Nepali Curriculum) deployed across 500+ schools in Nepal and beyond. I am working with Open Learning Exchange International, making EPaath more inclusive and scalable while helping in Planet.","links":[{"text":"EPaath","url":"https://epaath.olenepal.org"},{"text":"Planet","url":"https://planet.learning.ole.org/"}]},{"phase":"Present Focus and Forward Vision","description":"I look forward to contributing my passion and diverse skills while creating meaningful solutions and learning from equally driven teams."},{"phase":"Inspiration and Belief","description":"At the heart of my technological journey, I found inspiration in Nepal's landscapes, leading initiatives that showcased the transformative potential of technology in education. This profound experience fueled my belief in technology's power to make significant societal impacts, guiding me to collaborate with the MIT Game Lab. There, I immersed myself in exploring how gaming could revolutionize learning, pushing the boundaries of education in math and science."},{"phase":"Continuous Learning","description":"My calling demanded me to the University of Michigan. Here, I am embracing diverse cultures and experiences, all while maintaining a student's mindset—open, curious, and learning every day. As a student, I'm on a continuous quest to explore the depths of self and the world around me, always inspired by the endless possibilities of technology and driven by the desire to make a difference."},{"phase":"A Closing Note","description":"In sharing my story, I extend a 'Namaste' to you—the spirit in me bows to the spirit in you. Thank you for taking the time to join me on this journey."}]},"tags":{"tags":["experiences","reflections","writing"]},"created_at":"2024-01-02T04:08:00","backTo":"/stories","type":"introduction"}},"__N_SSG":true}