{"pageProps":{"story":{"id":"2023usreflection","title":"Reflections on Journey to the US from Nepal","content":{"details":[{"phase":"Visa Process","description":"Embarking on the journey to obtain my US F1 visa proved to be an odyssey all its own. By virtue of my prior travels to the US in 2019, the US Embassy kindly waived my visa interview, sparing me the agony of languishing in a lengthy queue. Armed with my I-20, passport, and Sevis receipt, I entrusted these documents to the delivery bank to submit on my behalf. After a week's time, the US Embassy contacted me, revealing that an in-person interview would, in fact, be required. Navigating the interview appointment process proved to be a breeze, and I found myself scheduled for an appointment the following week."},{"phase":"Interview and 221g","description":"However, at the interview, the visa officer issued me a 221g pink slip, leaving me again in a state of unease. As the weeks passed and my passport had been returned, my anxiety mounted as I anxiously awaited word on my visa status. After months of uncertainty and fruitless inquiries, all hope seemed lost. But, buoyed by patience and determination, I persisted, checking the visa application portal and sending numerous emails to the US Embassy. And then, at long last, I received the news I had been longing for: my visa had been granted. This arduous journey demanded much of me, but the investment of hope and perseverance was richly rewarded."},{"phase":"Travel to the US","description":"With a heavy heart and eager anticipation, I bade farewell to my loved ones and embarked on a journey with Qatar Airlines to begin my life as a graduate student at the esteemed University of Michigan-Dearborn in the United States. Despite my sadness at parting with those dear to me, I felt a surge of excitement as I eagerly anticipated the adventures that awaited me. As the flight progressed, I made a vow to capture every moment of my journey to share with the world via my regular vlogs."},{"phase":"Mid-flight Experience","description":"Mid-flight, I was thrilled to learn that the most highly anticipated football match of the year was taking place - the World Cup Final, pitting France against Argentina. Filled with the spirit of the moment, I eagerly hoped that Qatar Airlines, as the host nation of the World Cup, would offer streaming services to enable passengers to watch the game from the skies. Alas, this was not to be, and I was left to experience the thrill of the game vicariously through the enthusiasm of my fellow passengers."},{"phase":"Doha Transit","description":"As my plane touched down in Doha, I was greeted by the lively chants and boisterous cheers of locals and travelers alike, all of whom were gathered in front of massive screens, riveted to the World Cup Final. With the match headed into extra time, I knew I was in the right place at the right time to witness history in the making. And then it happened: Lionel Messi lifted the coveted trophy, and the air was thick with jubilation and exultation. In that moment, I felt an unparalleled sense of joy, sharing this thrilling experience with perfect strangers in the airport in Doha."},{"phase":"Long Transit in Doha","description":"Though my transit in Doha was lengthy – a whopping 19 hours – I spent much of my time seeking out a quiet sleeping pod to rest my weary body. It was during this time that I encountered a fellow traveler, also in the midst of a lengthy transit to JFK, New York. He was a frequent flyer, having spent nearly a decade in the United States and was a member of a prestigious lounge at the Doha Airport. We struck up a conversation, and I was delighted to hear his tales of adventure and struggles. Hours flew by as we shared our stories, and we parted ways with a promise to keep in touch through social media. Though his transit was only 13 hours, our encounter left an indelible mark on me, and I spent the rest of my time strolling around the airport and chatting with friends and family, eagerly awaiting my next flight."},{"phase":"Flight to Seattle","description":"As I boarded my 15-hour flight to Seattle, my heart was filled with anticipation for the long-awaited reunion with my dearest sister. The hours flew by as I drifted in and out of sleep, indulged in movies, and sipped on a few drinks. However, I couldn't shake off the anxiety about the immigration officer's questions. After all, I was entering through Seattle, even though my destination was Michigan. Thankfully, the officer turned out to be warm and friendly, and I was able to move on and meet my sister at the terminal."},{"phase":"Arrival in Seattle","description":"On the day of my arrival, the weather was gloomy, but my sister's warm embrace made me feel right at home. I was thrilled at the prospect of spending time with her, my brother-in-law, and my nephew. Though my initial days were filled with challenges, including a broken phone and limited outings, I began to appreciate the little things in life. I lived in the moment, basked in the present, and enjoyed every minute with my loved ones. My sister went above and beyond to make me feel welcome. She prepared a diverse range of cuisines, and over meals, we poured our hearts out, discussing family and life events. I am forever grateful to her for making my stay memorable. Though I may never be able to express my gratitude fully, her kindness and hospitality will always be etched in my heart."},{"phase":"Exploring Seattle","description":"Seattle will always hold a special place in my heart. I remember the days spent strolling through Pike Place Market, admiring the Space Needle, taking in the scenic views at Alki Beach, and exploring the fascinating exhibits at the Museum of Pop Culture. We also embarked on thrilling hikes to Snoqualmie Falls and Rattlesnake Ledge, where we immersed ourselves in the breathtaking beauty of Washington's natural landscape. Celebrating Christmas and New Year's with friends and family in Seattle was a unique and unforgettable experience, where I connected with some amazing Nepalese brothers and sisters. We visited charming towns like Fall City, Issaquah, Redmond, Sammamish, and Renton, and I even joined the Green Lake Running Group for the 10k run, the first run of the year. It was the most incredible vacation I have ever had! My sister gifted me a Pixel phone, and I got to learn a lot about navigating my university life in the US from the wonderful people I met in Seattle."},{"phase":"Transition to Michigan","description":"Those glorious 14 days came to an end, and it was time to move on to my graduate student life at the University of Michigan Dearborn. On January 3rd, 2023, I boarded Delta Airlines and flew to Detroit, Michigan. Though I had arranged for a pickup from the airport with a student organization at the University, I couldn't help but feel a twinge of sadness as I left the comfort of my sister's home. However, I was also excited for the challenges and learning experiences that awaited me as I ventured into independent living."},{"phase":"Arrival in Detroit","description":"Upon arriving in Detroit, I was greeted and promptly whisked away from the airport. I had anticipated that Michigan in January would be covered in a blanket of snow, but surprisingly, it was not! Upon arrival at my apartment building, I was welcomed with open arms by a friend and fellow Nepali, whom I had only dreamed of studying with. In the first few days, we had a blast learning to cook, do laundry, navigate the university, and most importantly, learning to live together in Dearborn. I was grateful to be living with such amazing roommates who were both helpful and understanding. It was quite an adventure for the first 15 days, as there were four of us squeezed into one room, with little personal space, but ample opportunities to get to know each other. Despite the cramped conditions, we were all on the same page, and we were living for the fun of it, knowing that it was only temporary."},{"phase":"University Life","description":"As international students, we all have certain preconceived notions and expectations of university life in the US. I can only speak for myself, but I certainly had certain feelings and ideas of what I was anticipating. I knew that the Dearborn campus of the University of Michigan was relatively small, so it was not a letdown at all. Despite the smaller campus size, it was still cozy and accessible. The professors were friendly and approachable, and the people were warm, despite the chilly weather. It finally started snowing in February."},{"phase":"Living in Fairlane Woods","description":"Despite the relatively unremarkable campus, I absolutely love the neighborhood we live in, Fairlane Woods. It feels like we are living amid a wild forest, with a small pond and ducks adding to the peaceful atmosphere. The gym is quiet, and the leasing office is warm and inviting, with some of the most thoughtful and kind people I've ever met. As most of the graduate students in our college are from neighboring nation, India, the conversations and experiences at the leasing office add to the diversity that I was anticipating. I used to meditate outdoors beside the pond, but now I work out and meditate inside the gym, as it is freezing outside."},{"phase":"Moving Day","description":"One of the most exciting days so far was moving day! We found a beautiful, bright, spacious, and clean apartment and were thrilled to be moving into it. I had never experienced moving out and moving in before, and let me tell you, it was quite a lot of work, even though we were only moving a short distance away. Luckily, some of our new friends from the leasing office lent us their time, their cars, and their moving cart, making the process much easier. It took four full days to move our few things, but it was well worth it. We were happy and excited to call this place our own. Living with others can be challenging, without any space for honesty, but I feel fortunate that my roommates and I talk things out as they arise, building upon these small stories. This is why it has not been so difficult to live with them, and hopefully, the feeling is mutual."},{"phase":"Daily Life","description":"Living on our own has its charms; life seems to move at a rapid pace, as there are hardly any dull moments. Between attending university classes, completing assignments, doing home chores, and keeping in touch with friends and family, it feels like time just flies by. And I must say, it has been delightful! However, one significant downside is that it's almost impossible to do anything in Dearborn without a car. Even walking to the nearest grocery store is out of the question. Fortunately, the university shuttle takes us to the grocery store every week on Saturdays. Though, there are moments when I am shocked to see how expensive everything is, and I start counting the banknotes in rupees at the counter. But eventually, we acclimate ourselves to the world around us."},{"phase":"University Events","description":"The university offers many events, ensuring that there is always something to do. And when I need some time to myself, I can take a stroll along the nature trail to Fair Lane Lake or Rouge River, both located within the university's periphery. Although I have been running around Michigan Avenue, I have yet to venture into any of the cafes. I did get a chance to go to Detroit Downtown, but that is a story for another day."},{"phase":"Reflection","description":"It's been quite a journey so far - I've made new friends, picked up useful life skills, familiarized myself with the city's geography, settled into university life, connected with some inspiring professors, and even pursued a certification. However, there's still so much more to experience and explore, and I'm eagerly waiting to get behind the wheel and hit the road. After all, having a car in the US is almost a necessity!"},{"phase":"Conclusion","description":"With numerous expectations to meet and a plethora of challenges to overcome, I'm learning to manage my time more effectively. I'm prioritizing my goals, creating actionable plans, and striving to strike a healthy balance in my daily routine. Life has taught me to adjust my expectations, and I'm slowly but surely learning to adapt to the ebb and flow of life's challenges. It's a constant battle, but I'm determined to emerge stronger and wiser. Thank you for reading my story. Stay tuned for more updates!"}]},"tags":{"tags":["experiences","reflections","writing"]},"created_at":"2024-01-08T20:08:08","backTo":"/experiences","type":"experiences"}},"__N_SSG":true}